#include<stdio.h>

typedef struct employee{
    int num;
    char name[30];
    char phone_number[20];
    int age;
}EMPLOYEE;

EMPLOYEE person[10] = {
        {231100,"홍길동","010-111-1111",31},
        {231101,"홍길동1","010-222-2222",20},
        {231102,"홍길동2","010-111-1112",25},
        {231103,"홍길동3","010-222-2223",45},
        {231104,"홍길동4","010-111-1113",32},
        {231105,"홍길동5","010-222-2224",50},
        {231106,"홍길동6","010-111-1114",65},
        {231107,"홍길동7","010-222-2225",45},
        {231108,"홍길동8","010-111-1115",23},
        {231109,"홍길동9","010-222-2226",29},
    };

int main(void){
    int i;
    for(i=0;i<10;i++){
        if(20 <= person[i].age && person[i].age <= 30){
            printf("이름: %s 나이: %d\n",person[i].name,person[i].age);
        }
    }
}